# 2) კომენტარებით ახსენით რა არის ფუნქცია და როგორ გვიმარტივებს ის კოდის წერის პროცესს
# ფუნქცია არის კოდის ბლოკი, რომელსაც კონკრეტული დავალება აქვს
# მისი საშუალებით კოდი უფრო მარტივი და გასაგები ხდება
# ასევე შეგვიძლია ერთხელ დავწეროთ და ბევრჯერ გამოვიყენოთ

# 3) კომენტარებით ახსენით რა არის არგუმენტი
# არგუმენტი არის მონაცემი, რომელსაც ფუნქციაში გადავცემთ
# მაგალითად სახელი, რიცხვი, ტექსტი და ა.შ.
# არგუმენტის დახმარებით ფუნქცია უფრო მოქნილი ხდება

# 4) კომენტარებით ახსენით რა არის dot ნოტაცია და როგორ ფუნქციებზე იყენებენ მას
#dot ნოტაცია ნიშნავს წერტილის გამოყენებით ობიექტის ფუნქციაზე ან თვისებაზე წვდომას

# 5) დღეს ნასწავლ ფუნქციებზე გააკეთეთ 5-5 რთული მაგალითი
name="merabi"
print(name.upper())
print(name.lower())

name1="me var rostevani"
print(name1.capitalize())
print(name1.title())

name3="ME, VAR, malxazi"
print(name3.find("i"))