# 1) კომენტარებით ახსენით რა არის explicity და implicity. მოიყვანეთ მათი მაგალითები.
# explicity არის როდესაც ხელოვნურად გარდაქმნი ერთი ფუნქციიდან მეორე ფუნქციაზე მაგ:
age=15
print(str(age))# ეს გამოიტანს როგორც სტრინგ ფუნქციად 
#implicity კი როდესაც კომპიუტერი თითონ უცვლის ფუნქციას მაგ:
numb1=10
numb2=2
print(numb1/numb2) #ეს გამოიტანს ათწილადს ანუ floatს-5.0 როცა უნდა გამოტანა integeri-5 ანუ კომპიუტერმა მას ფუნქცია შუცვალა

# 2) შექმენით 2 ცვლადი, ერთში შეინახეთ თქვენი სახელი, მეორეში ასაკი.(ასაკი უნდა იყოს შენახული როგორც integer-ი)

# ამ ცვლადების გამოყენებით შექმენით წინადადება, მაგალითად:

# "My name is {name}. I'm {age} years old."

# ამ დავალების შესრულებაში დაგჭირდებათ რომელიღაც ცვლადისთვის მონაცემთა ტიპის შეცვლა, რომ მოახდინოთ კონკადინაცია.
name1="Nini"
age=17
print("my name is" +  name1  + "i am " + str(age)+ "years old")
# 3) მომხმარებელს შემოატანინეთ საყვარელი რიცხვი და დაბეჭდეთ ის მე-5 ხარისხში(ვისაც არ გახსოვთ ხარისხში აყვანა, იწეება შემდეგ ნაირად: {რიცხვი რომლის აყვანაც გინდათ ხარისხში} ** {რომელ ხარისხში გინდათ აყვანა})
numb3=int(input("enter your favorite number:"))
print(numb3**2)
# 4) მოიძიეთ ინფორმაცია if/else-ებზე და შეეცადეთ გააკეთოთ რამოდენიმე მაგალითი.
a = 86
b = 100
if b > a:
  print("b is more than a")

a = 600
b = 100
if b > a:
  print("b is more than a")# აქ ამოაგდებს რომ ის არ არის აზე მეტი

a = 700
b = 3
if b > a:
  print("b is more than a")
else:
  print("b is not more than a")

a = 800
b = 3000
if b > a:
  print("b is more than a")
else:
  print("b is not more than a") # აქ ამოაგდებს რომ ბ არის აზე მეტი
