# 2) კომენტარებით ახსენით რისთვის გვჭირდება int ფუნქცია და როგორ მუშაობს ის. მოიყვანეთ მაგალითები.
#int არის ფუნქცია რომელსაც ფრჩხილებში გადაეცემა string რიცხვს და ის გადააქცევს მას მათემატიკურ მთელ რიცხვად მაგ:
# numb1=input()
# numb2=input()
# print(numb1 + numb2) ეს არასწორია და არაფერს არ გამოგვიტანს 
# numb1=int(input())
# numb2=int(input())  ეს სწორია
# print(numb1 + numb2)


# 3) მომხმარებელს შემოატანინეთ 5 რიცხვი და გაიგეთ მათი საშუალო არითმეტიკული
one=int(input("ჩაწერეთ რიცხვი:"))
two=int(input("ჩაწერეთ რიცხვი:"))
three=int(input("ჩაწერეთ რიცხვი:"))
four=int(input("ჩაწერეთ რიცხვი:"))
five=int(input("ჩაწერეთ რიცხვი:"))
print(one + two + three + four + five /5)

# 4) კომენტარების სახით ჩამოწერეთ ყველა ნასწავლი მონაცემთა ტიპი. დაახასიათეთ ისინი და თითოეულზე მოიყვანეთ 3-3 მაგალითი
#ვიცით ტექსტური მონაცემთ ტიპი, ის აუცილებლად უნდა დაიწეროს ბრწყალებში მას კი ეწოდება string
#"vashli "msxali "7"
#კიდევ რიცხვითი მონაცემთა ტიპი, რომელიც ნიშნავს მთელ რიცხვს. იწერება ბრჭყალების გარეშე მას  integer  ეწოდება
# 6 8 9 10
#კიდევ რიცხვითი მონაცემთა ტიპი, რომელიც ნიშნავს ათწილად რიცხვს- float
#10.5 10.6...
# int ფუნქცია ის ფრჩხილებში გადაცემულ string რიცხვს გადააქცევს მათემატიკურ რიცხვად
#numb=int(input())
# type ფუნქცია რომელიც გვიბრუნებს, ფრჩხილებში გადაცემული მონაცემის ტიპს
#type(15) -> <class 'int'>
#type("NINI") -> <class 'str'>
# type(7.5) -> <class 'float'>
