# 2) კომენტარებით ახსენით რა არის return keywor-ი დეტალურად და მოიყვანეთ მაგალითი, სადაც მას იყენებთ და დეტალურად აღწერეთ აქაც თითოეული ნაბიჯი
# return ის მთავარი დანიშნულება არის ფუნქციის შესრულების შედეგის დაბრუნება
# 3) შექმენით ფუნქცია, რომელსაც გადაეცემა რიცხვების სია და პასუხად აბრუნებს თითოეული რიცხვის ნამრავლს. გამოიძახეთ ეს ფუნქცია, გადაეცით მას სასურველი სია და ჩასვით ის print-ში.

# 4) შექმენით ფუნქცია, რომელიც რომელსაც გადაეცემა რაღაც რიცხვი და ის აბრუნებს მას, შემდეგ შექმენით კიდევ ერთი ფუნქცია, რომელსაც ასევე გადაეცემა რაღაც რიცხვი.

# გამოძახეთ მეორე ფუნქცია და არგუმენტად გადაეცით პირველი ფუნქციის გამოძახება, რომელსაც გადასცემთ თქვენთვის სასურველ რიცხვს. მიღებული პასუხი შეინახეთ ცვლადში და დაბეჭდეთ

# 5) გადახედეთ შემდეგ რესურსს: