# კომენტარებით ახსენით რა არის string-ი, integer-ი და float-ი და ჩამოწერეთ მათი მაგალითები.
#string-ეს არის ტექსტური მონაცემი, რომელიც აუცილებლად უნდა ჩაიწერსო ბრჭყალებში
#integer-ეს არის რიცხვითი მონაცემტა ტიპი, რომელიც წარმოადგენს მთელ რიცხვებს და იწერება ბრჭყალების გარეშე
# float-ეს არის რიცხვითი მონაცემთა ტიპი, რომელიც წარმოადგენს ათწილად რიცხვებს 



#3) გაასწორეთ შემდეგი კოდი:
number = 10
word ="Car"
print(number) # 10
print (word)

#4) შექმენით 2 ცვლადი, პირველში შეინახეთ string-ი, მეორეში კი integer-ი. დაბეჭდეთ მათი ჯამი და მოიძიეთ, რატომ გამოიტანს ეს კოდი შეცდომას.
name="Nini" 
age=17
print(name+age)#აქ შეცდომას გამოიტანს, რადგან ეს ორი სხვადასხვა ტიპის მონაცემებია 
#და ის ვერ მიხვდება ტუ როგორ გააერთიანოს ეს ორი მონაცემი ერთად
#5) მოიძიეთ თუ რა განსხვავებაა print(5 + 5)-სა და print("5" + "5")-ს შორის და ახსენით კომენტარებით
print(5+5)
print("5"+"5")#აქ რიცხვებს ბრჭყალები არ სწირდება, პითონმა წაიკითხა ის როგორც ტექსტად და არა როგორც ციფრებად 
#ამიტომაც ის გააერთიანა და გახადა 55