

#3)
numbers = [12, 7, 9, 20, 33]  # 5 ელემენტიანი სია

for num in numbers:
    if num % 2 == 0:
        print("[num] არის ლუწი")
    else:
        print("[num] არის კენტი")




# 4) შექმენით 5 ელემენტიანი სია და დაბეჭდოთ თითოეული მნიშვნელობა for ციკლის დახმარებით
my_list = [10, 25, 37, 42, 58]  # 5 ელემენტიანი სია

for item in my_list:
    print(item)
# 5) შექმენით 4 ელემენტიანი რიცხვების სია, თქვენი დავალებაა დაბეჭდოთ ამ სიაში მყოფი რიცხვები გაორმაგებული მნიშვნელობის სახით

nums=[1, 2, 3, 4]
for i in nums:
    print(i*2)