# 1) კომენტარებით ახსენით რა არის input/output-ი. (ახსენით დეტალურად და მოიყვანეთ input/output დევაისების მაგალით)
#input არის როდესაც კომპიუტერში შეგვაქვს ინფორმაცია მაგალითად მიკროფონი მიკროფონში შედის ჩვენი ხმა ხოლო სხვა ადამიანთან კი გამოდის
#ამ კომპიუტერიდან გამოსვლას კი outputი ეწოდება, outputიდან გამოდის ჩვენი შეტანილი ინფორმაცია

# 2) მომხმარებელს შემოატანინეთ სახლი, გვარი და ასაკი, თითოეული მათგანი შეინახეთ ცვლადებში(დაგჭირდებათ 3 ცვლადი). 
# ამ ცვლადების გამოყენებით შექმენით წინადადება და დაბეჭდეთ terminal-ში(წინადადების შესაქმნელად დაგჭირდებათ
#  კონკადინახია)
name=input("please enter your name:")
print("my name is"+ name)
username=input("please enter your username:")
print("my username is" + username)
age=input("please enter your age:")
print("i am"+ age)
