# 2) კომენტარებით ახსენით, რა არის snake case-ი
# როდესაც ცვლადი შედგება 3 ან 2 სიტყვისგან მისი ცალ-ცალკე დაწერა დაუშვებელია, კი შეიძლება ერთად დაწერა მაგრამ ის წასაკითხად ძნელი იქნება 
# ამიტომაც ცვლადებს შორის ვწერთ ქვედა ტირეს ამას კი snake case ეწოდება ის ჩვენ ძალიან გვიმარტივებს საქმეს, ადვილად წასაკითხს ხდის ცვლადს 

# 3) მომხმარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ მათი ჯამი. გატესტეთ კოდი და მოიძიეთ ინფორმაცია, თუ რატომ არ დაიბეჭდა სასურველი შედეგი და როგორ შეიძლება ამ პრობლემის მოგვარება.(რიცხვების ჯამი არ გამოვა, ისინი უბრალოდ ერთმანეთს მიეწებებიან)
# ამის აზრს ვერ მივხვდი 
