# 2) კომენტარებით ახსენით რა არის ალგორითმი.
#ალგორითმი არის როდესაც  დაწერილია რაიმე ინსტრუქცია და შენ ამ ინსტრუქციას ნაბიჯ ნაბიჯ მიყვები 

# 3) კომენტარებით ახსენით რა არის sequencing, iteration, selection, მოიყვანეთ რეალური ცხოვრების მაგალითი სამივე მათგანზე.
#Sequencing ნიშნავს ინსტრუქციების შესრულებას ზუსტად იმ თანმიმდევრობით, როგორითაც ისინი დაწერილია კომპიუტერი ჩენს კოდებს ზემოდან ქვემოთ კითხულობს
#მაგ:ყიყლიყოს რეცეპტი ბოდიშიტ მას მოგპარეთ თქვენი ყიყლიყოს რეცეპტი
#iteration ნიშნავს როდესაც ერთი და იგივე ინსტრუქციას იმეორებ რამდენჯერმე ეს იგივეა რაც ციკლი(loop)
#მაგ: ვარჯიში ვარჯოშზე აკეთებ რამოდენიმე გამეორებას(sets)
#Selection არჩვა პირობის მიხედვით 
#მაგ:შუქნიშანზე მოძრაობა ტუა მწვანე წადი ხოლო ტუ წითელი გაჩერდი


# 4) კომენტარებით ახსენით რა არის flowchart-ი, pseudo code და natural language. შეეცადეთ შექმნათ.
# flowchart არის რაიმე ინფორმაცია რომელიც გამოსახულია სურათით ან ნახატით
#pseudocode ინფორმაციის ახსნა პროგრამირების ენით
#natural lenguage ინფორმაციის ახსნა ადამიანისთვის გასაგებ ენაზე
