#შექმენით ცვლადი და შეინახეთ მასში ნებისმიერი სიტყვა. გაამრავლეთ ეს ცვლადი ნებისმიერ რიცხვზე და ნახეთ შედეგი.
name="nini"
print(name * 15)#ეს ცვლადი 15ჯერ დამიწერა გადაბმულად
#კომენტარი არის ტექსტი რომელსაც პითონი არ ასრულებს და აიგნორებს ის # სიმბოლოტი იწერება ხოლო ის გვეხმარება კოდის ახსნაში,
#  დროებით შენიშვნაში - როდესაც შცდომას დაუშვებ შეგიძლია ის დააკომენტარო ხოლო პითონი ამ ტეხტს დააიგნორებს და შცდომასაც არ ამოაგდებს
# სხვა პროგრამირებისთის ინფორმაციის დატოვებაშ 

integer=17
float=0.4
together=17*0.4
print(together ** 2)

name2="nini"
username="osepashvili"
print("hello "+ "my name is "+ name2+ "and my username is "+username)

