# 1) შექმენით სია შემდგარი მინიმუმ 10 ელემენტისგან და დაბეჭდეთ მისი სიგრძე(მასში ელემენტთა რაოდენობა). ამისათვის გამოიყენეთ დღეს ნასწავლი len ფუნქცია
numbers=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(len(numbers))
numbers.append("merabi")
numbers.append("saba")
print(numbers)
# 2) შექმენით ცვლადი სადაც შეინახავთ თქვენს სახელს და დაბეჭდეთ მისი სიგრძე(მასში ელემენტთა რაოდენობა)
name="nini"
print(len(name))
# 3) პირველ დავალებაში შექმნილ სიას დაუმატეთ ორი ელემენტი(მაგალითად ორი სახელი) .append ფუნქციის გამოყენებით და ყოველი ცვლილებისას დაბეჭდეთ განახლებული სია
# 4) შექმენით 5 ელემენტიანი სახელების სია. მე-4 და მე-5 ელემენტებს შორის ჩაამატეთ ახალი სახელი.

# იგივე სიის თავში ჩაამატეთ კიდევ ერთი სახელი და დაბეჭდეთ მიღებული სია.

names1=["nini", " lika", "saba", "merabi", "malxazi"]
names1.insert(4, "murmani")
print(names1)
names1.pop()
names1.pop(3)
print(names1)

# 5) მე-4 დავალებაში შექმენილ სიაში წაშალეთ ბოლო და მე-2 ინდექსზე მყოფი ელემენტები