# შექმენით რიცხვების სია, სადაც გექნებათ 10 ელემენტი და დაბეჭდეთ

# 1) დაბეჭდეთ ამ სიის მეხუთე ელემენტი
# 2) დაბეჭდეთ ამ სიის მეშვიდე ინდექსზე მდგომი ელემენტი
# 3) დაბეჭდეთ ეს სია თავიდან ბოლომდე slicing-ის გამოყენებით
# 4) დაბეჭდეთ ეს სია შემოტრიალებულად
# 5) დაბეჭდეთ ამ სიის ყოველი მე-4 ელემენტი
# 6) დაბეჭდეთ ან სიის პირველი ელემენტიდან მე-5 ელემენტის ჩათვლით ყველა ელემენტი
# 7) დაბეჭდეთ ამ სიი პირველი ინდექსიდან მე-8 ინდექსის ჩათვლით ყოველი მე-2 ელემენტი
# 8) შეცვალეთ ამ სიის მე-2 ელემენტი თქვენი სახელით და დაბეჭდეთ სია
# 9) შეცვალეთ ამ სიის მე 2 ინდექსზე მყოფი ელემენტი თქვენი მეოგობრის სახელით და დაბეჭდეთ სია
# 10) გაუცვალეთ სიაში მე-2 და მე-3 ელემენტებს ადგილები და დაბეჭდეთ სია


numbers=[100, 10, 20, 40, 50, 60, 80,90, 70]
print(numbers[4])
print(numbers[7])
print(numbers[:])
print(numbers[::-1])
print(numbers[::3])
print(numbers[:5])
print(numbers[:9:2])
numbers[1]="nini"
print(numbers)
numbers[2]="mari"
print(numbers)
numbers[1], numbers[2]=numbers[2],numbers[1]
print(numbers)