# 1) შექმენით 5 ელემენტიანი სახელების სია და slicing-ის გამოყენებით დაბეჭდეთ პირველი ინდექსიდან 3 ინდექსამდე ყველა ელემენტი
numbers=[11, 12, 33, 45, 66]
print(numbers)
print(numbers[0:3:1])
# 2) შექმენით 10 ელემენტიანი რიცხვების სია და დაბეჭდეთ მისი ყოველი მეორე ელემენტი
numberss=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(numberss)
print(numberss[0::2])
print()
print(numberss[2:6:1])
print()
print(numberss[2:-2:3])
print()
print(numberss[: :-1])
# 3) იგივე სიიდან დაბეჭდეთ მე-3, მე-4, მე-5 და მე-6 ელემენტები



# 4) იგივე სიიდან დაბეჭდეთ მე-2 ინდექსიდან დაწყებული -2 ინდექსამდე ყოველი მესამე ელემენტი

# 5) დაბეჭდეთ იგივე სია შემოტრიალებულად