# 1) დაბეჭდეთ 0-დან 100-მდე ყველა რიცხვი. 
for i in range(0,100):
    print(i)

# 2) დაბეჭდეთ 0-დან 100-ის ჩათვლით ყველა რიცხვი.
for i in range(0,101):
    print(i)

# 3) დაბეჭდეთ 10-დან 20-მდე ყველე რიცხვი
for i in range(10, 20):
    print(i)

# 4) დაბეჭდეთ 100-დან 200-ის ჩათვლით ყოველი მე-5 რიცხვი
for i in range(100,201,5):
    print(i)

# 5) დაბეჭდეთ 10-დან 0-ის ჩათვლით ყველა რიცხვი
for i in range(10, 0):
    print(i) #არამგონია მას ეს სწორი იყოს

# ეს დავალებები შეასრულეთ for loop-ის გამოყენებით