# 2) კომენტარებით ახსენით რა არის არგუმენტი
#არგუმენტი არის მნიშვნელობა, რომელსაც ფუნქციას გადასცემ, როცა მას იძახებ

# 3) კომენტარებით ახსენით რა არის range ფუნქცია
#range არის დიაპაზონი რამდენ რიცხვსაც ჩავუწერთ ფრჩხილებში იმდენჯერ გაიმეორებს ის ჩვენს მიერ გადაცემულ ტექსტს

# 4) დაბეჭდეთ 50-დან 100-ის ჩათვლით ყველა რიცხვის ჯამი
for i in range(0, 101, +1): #ესენი კარგად ვერ მივხვდი ნამრავლი და ჯამი როგორ დავბეწდო
    print(i)

# 5) დაბეჭდეთ 100-დან 200-მდე ყველა რიცხვის ნამრავლი
for i in range(100, 200):

# 6) კომენტარებით ახსენით რა განსხვავებაა for და while ციკლებს შორის

#for ციკლი იმისტვის გამოიყენება როცა იცი თუ პირობა რამდენჯერ უნდა გაამეორო
#while ციკლი — როცა არ იცი რამდენჯერ უნდა დაბეწდო, და ამეორებ იმ პირობას სანამ სწორ სიტყვას ან რიცხვს არ ჩავწერთ
#ესეც ვერ მივხვდი როგორ ვქნა 

# 7) while ციკლის გამოყენებით დაბეჭდეთ დაბეჭდეთ 1-დან 10-ის ჩათვლით ყველა რიცხვი

 number="123456789"
user=int(input("Enter the number:"))
while number !=user:
    print("wrong number")
    user = input("Please enter your password: ")

print("you win!")

