# 1) კომენტარებით დეტალურად ახსენით რა არის ფუნქცია.
# ისაუბრეთ მის შექმნაზე და გამოძახებაზე
#def ფუნქცია გვეხმარება კოდის გამოძახებაში ჯერ ვწერთ def ფუნქციას და სახელს თუ რაც გვნდა რომ დავარქვათ შემდეგ ვუწერთ():
#ხოლო შემდეგ ვიწყებთ კოდის წერას თუ რა ფუნქცია მივანიწოთ ამ კოდს რომ დვასრულებთ ფუნქციის წერას და გამოზახება გვინდა ვწერთ 
# #ჩვენ მიერ შქმნილი ფუნქცისს სახელს და ბოლოში ვუწერთ() 

# 2) შექმენით ფუნქცია test, რომელიც დაბეჭდავს ნებისმიერ წინადადებას.
# შემდეგ გაუშვით კოდი და კომენტარებით ახსენით რატომ არ გამოიტანა ტერმინალში ამ ფუნქციამ პასუხი.

# შემდეგ გამოიძახეთ ეს ფუნქცია 3-ჯერ და გაუშვით კოდი


# 3) შექმენით ფუნქცია, რომელიც მომხმარებლისგან მიიღებს 5 რიცხვს და დაბეჭდავს მათ საშუალო არითმეტიკულს.
# რიცხვების შემოტანისთვის გამოიყენეთ for ციკლი და input ფუნქცია.

# 4) შექმენით sayHi, რომელიც დაბეჭდავს თქვენი სახლისთვის მისალმებას.

# შექმენით ცვლადი და შეინახეთ მასში ამ ფუნქციის გამოძახება, შემდეგ დაბეჭდეთ შექმნილი ცვლადი და ნახეთ შედეგი.
# კომენტარებით ახსენით თუ რატომ მიიღეთ ასეთი შედეგი

def test():
    print("hi my name is nini")
    print("i am learning code")
    print("hello world") #ეს ფუნქცია იმიტომ არ გაისჰვება რადგან ჩვენ ბოლოში არ მივეცით გამოძახების უფლება ბოლოშ უნდა დაგვეწერა
    #ჩვენ ფუნქციის სახელი და რჩხილები test()

for i in range(3):
    test()


# def num():
#     num1=int(input("enter the number"))
#     num2=int(input("enter the number"))
#     num3=int(input("enter the number"))
#     num4=int(input("enter the number"))
#     num5=int(input("enter the number"))
#     print(num1 * num2 * num3 * num4 * num5 /5)
# num()

def say_hi():
    print("HELLO NINI")
print(say_hi) # ფუნქციის გამოძახებისას აუცილებელია დავწეროთ ფუნქციის სახელი და ფრჩხილები ხოლო მე რომ ეს ცვლადში 
#ჩავსვი მან მხოლოდ ფუნქციის მისამართი ჩამიგდო და არა თითონ ფუნქცია

    
    