# 1) დაწერე ფუნქცია სახელად `add_numbers`, რომელსაც გადაეცემა ორი რიცხვი.
# ფუნქციამ უნდა დააბრუნოს ამ ორი რიცხვის ჯამი.

# 2) დაწერე ფუნქცია სახელად `average`, რომელსაც გადაეცემა სამი რიცხვი.
# დააბრუნე ამ სამი რიცხვის საშუალო არითმეტიკული.

# 3) დაწერე ფუნქცია სახელად `max_number`, რომელსაც გადაეცემა ორი რიცხვი.
# დააბრუნე უდიდესი რიცხვი.

# 4) დაწერე ფუნქცია სახელად `even_or_odd`, რომელსაც გადაეცემა ერთი რიცხვი.
# თუ რიცხვი ლუწია, დააბრუნე `"ლუწი"`, თუ კენტია — `"კენტი"`.

# 5) დაწერე ფუნქცია სახელად `sum_list`, რომელსაც გადაეცემა სია რიცხვებით.
# ფუნქციამ უნდა დააბრუნოს სიაში არსებული რიცხვების ჯამი.

# 6) დაწერე ფუნქცია სახელად `filter_even`, რომელსაც გადაეცემა სია რიცხვებით.
# დააბრუნე ახალი სია, რომელშიც მხოლოდ ლუწი რიცხვები იქნება.

# 7) დაწერე ფუნქცია სახელად `word_length`, რომელსაც გადაეცემა ერთი სიტყვა (სტრინგი).
# დააბრუნე ამ სიტყვის სიგრძე (რამდენი ასოა მასში).

# 8) დაწერე ფუნქცია სახელად `longest_word`, რომელსაც გადაეცემა სია სიტყვებით.
# დააბრუნე ყველაზე გრძელი სიტყვა ამ სიიდან.

# 9) დაწერე ფუნქცია სახელად `square`, რომელსაც გადაეცემა ერთი რიცხვი.
# დააბრუნე ამ რიცხვის კვადრატი.

def add_number():
    a=1
    b=4
    print(a+b)
add_number()

def average(num1, num2, num3):
   return num1 + num2 + num3/3
numbers=average(5, 6, 7)
print(numbers)

def even_or_odd(num1):
    if num1 %2==0:
        return "this number is odd"
    else:
        return "this number is even"
    
number2=even_or_odd(2)
print(number2)

def max_number(numb1, numb2):
    if numb1>numb2:
        return numb1
    else:
        return numb2
numbers3=max_number(19,16)
print(numbers3)