# 1) დაწერეთ 2-2 მაგალითი შედარების ოპერატორებზე(>, <, <=, >=, ==, !=)
print(30>40)
print(30<70)
print(30<=50)
print(60>=100)
print(50<=120)
print(100==122)
print(100==100)
print(40!=10)
print(40!=40) # ეს არვიცი მას რას ნისშნავს
# 2) დაწერეთ მაგალითები შედარების ოპერატორებზე.
print(60>50)#true
print(50<10)#false


# 3) სანამ ამ კოდს გაუშვებდეთ, კარგად იფიქრეთ ამის პასუხზე(პასუხი იქნება ერთ-ერთი, ორი Boolean მნიშვნელობებიდან True/False)

#print(True and False or 5 > 10 and 100 / 5 > 10 and "Python" == "Python" or 2 * 3 < 5 or 6 + 7 - 9 < 20 and True and 5 > 5.0 or 10 - 10 < 100)
# მას ეს ვერ გავიგე