# 2) კომენტარებით ახსენით რა არის Boolean და binary code
#binary code არის ორობითი კოდი რომელიც იყენებს მხოლოდ 0 და 1
#boolean იყენებს მხოლოდ true და false  ის არის ლოგიკური ტიპი
# 3) ისწავლეთ ყველა შედარების ოპერატორი და გააკეთეთ მაგალითები
a=10
b=5
print(a>b)
print(a<b)
print(a==b)
print(a!=b)
print(a>=b)
print(a<=b)

# 4) გადახედეთ რესურსებში მოცემულ მაგალითებს ლოგიკურ ოპერატორებზე და გააკეთეთ 5 მაგალითი, სადაც გამოიყენებთ შედარების და ლოგიკურ ოპერატორებს

print(10>5)
print(10<5)
print(5<5)
print(15>100)
# 5) მომხმარებელს შემოატანინეთ რიცხვი და თუ ის არის ლუწი ან იყოფა 5-ზე დაბეჭდეთ True, სხვა ნებისმიერ შემთხვევაში დაბეჭდეთ False(დაგჭირდებათ %-გაყოფა)
c=10
if c % 5:
    print(True)
else: 
    print(False)