# # 1) მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ შეამოწმეთ თუ ეს რიცხვი არის 10-ზე დაბეჭდეთ "{ჩასვამთ რიცხვს, რომელსაც მომხარებელი შემოიყვანს} არის 10-ზე ნაკლები", სხვა შემთხევევაში თუ 20-ზე ნაკლებია დაბეჭდავთ "{ჩასვამთ რიცხვს, რომელსაც მომხარებელი შემოიყვანს} არის 20-ზე ნაკლები"

# # ამისთვის დაგჭირდებათ if/elif
# user=int(input("ENTER NUMBER:"))
# if user ==10:
#     print("ეს რიცხვი არი 10")
# elif user<20:
#     print("ის არის 20ზე ნაკლები")

# # 2) მომხარებელს შემოატანინეთ რიცხვი და თუ ის არის ლუწი დაბეჭდეთ "The number is even", სხვა შემთხვევაში დაბეჭდეთ "The number is odd"
# num=int(input("enter the number:"))
# if num%2:
#     print("this number is even") 
# else:
#     print("this number is odd")
# # 3) მომხმარებელს შემოატანინეთ ამინდი და თუ ის არის "მზიანი", დაბეჭდეთ "ვივარჯიშებ გარეთ", სხვა შემთხვევაში თუ "წვიმიანი", დაბეჭდეთ "ვივარჯიშებ გარეთ", ხოლო სხვა დანარჩენ შემთხვევაში დაბეჭდეთ "არ ვივარჯიშებ დღეს"

# weather = input("როგორია ამინდი დღეს? ")
# if weather == "მზიანი":
#     print("ვივარჯიშებ გარეთ")
# elif weather == "წვიმიანი":
#     print("ვივარჯიშებ გარეთ")
# else:
#     print("არ ვივარჯიშბ დღეს")


name=input("enter your name:")
for i in range(3):
    print(name)
   